<?php

declare(strict_types=1);

return [
    'login_title' => 'Вход',
    'email' => 'Электронная почта',
    'password' => 'Пароль',
    'remember_me' => 'Запомнить меня',
    'forgot_password_link' => 'Забыли пароль?',
    'log_in' => 'Войти',

    'register_title' => 'Регистрация',
    'name' => 'Имя',
    'confirm_password' => 'Подтверждение пароля',
    'already_registered' => 'Уже зарегистрированы?',
    'register' => 'Зарегистрироваться',

    'or_continue_with' => 'Или продолжить с помощью',
    'continue_with_google' => 'Продолжить через Google',
    'continue_with_facebook' => 'Продолжить через Facebook',

    'forgot_password_title' => 'Забыли пароль',
    'forgot_password_intro' => 'Забыли пароль? Не проблема. Просто укажите свой адрес электронной почты, и мы отправим вам ссылку для сброса пароля, чтобы вы могли выбрать новый.',
    'email_password_reset_link' => 'Отправить ссылку для сброса пароля',

    'reset_password_title' => 'Сброс пароля',
    'reset_password' => 'Сбросить пароль',

    'confirm_password_title' => 'Подтверждение пароля',
    'confirm_password_intro' => 'Это защищённый раздел приложения. Пожалуйста, подтвердите свой пароль, прежде чем продолжить.',
    'confirm' => 'Подтвердить',

    'verify_email_title' => 'Подтверждение почты',
    'verify_email_intro' => 'Спасибо за регистрацию! Прежде чем начать, подтвердите, пожалуйста, свой адрес электронной почты, перейдя по ссылке, которую мы вам отправили. Если вы не получили письмо, мы с радостью отправим ещё одно.',
    'verification_link_sent' => 'Новая ссылка для подтверждения была отправлена на адрес электронной почты, указанный при регистрации.',
    'resend_verification_email' => 'Отправить письмо с подтверждением ещё раз',
    'log_out' => 'Выйти',
];
